export const questionsMass = [
  {
    id: 0,
    text: "Автор фразы: «Сей чин – яко око наше»:",
    variants: [
      {
        text: "Суворов Александр Васильевич",
        isRight: false,
        id: 0,
      },
      {
        text: "Петр I",
        isRight: true,
        id: 1,
      },
      {
        text: "Меньшиков Александр Данилович",
        isRight: false,
        id: 2,
      },
      {
        text: "Ягужинский Павел Иванович",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 1,
    text: "Дата создания прокуратуры Российской Империи:",
    variants: [
      {
        text: "12 января 1918 года",
        isRight: false,
        id: 0,
      },
      {
        text: "12 января 1730 год",
        isRight: false,
        id: 1,
      },
      {
        text: "12 января 1722 года",
        isRight: true,
        id: 2,
      },
      {
        text: "12 января 1721 года",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 3,
    text: "Первый Генерал-прокурор Сената",
    variants: [
      {
        text: "Меньшиков Александр Данилович ",
        isRight: false,
        id: 0,
      },
      {
        text: "Ягужинский Павел Иванович ",
        isRight: true,
        id: 1,
      },
      {
        text: "Голицын Дмитрий Михайлович",
        isRight: false,
        id: 2,
      },
      {
        text: "Потемкин  Григорий Александрович",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 4,
    text: "Цели создания прокуратуры:",
    variants: [
      {
        text: "борьба с казнокрадством  и волокитой в государственных делах",
        isRight: true,
        id: 0,
      },
      {
        text: "сбор казны и прочего",
        isRight: false,
        id: 1,
      },
      {
        text: "контроль за деятельностью государственного аппарата",
        isRight: false,
        id: 2,
      },
      {
        text: "контроль за исполнением царских указов",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 5,
    text: "С 1802 года институт прокуратуры  стал составной частью вновь образованного:",
    variants: [
      {
        text: "Министерства иностранных дел",
        isRight: false,
        id: 0,
      },
      {
        text: "Министерства внутренних дел",
        isRight: false,
        id: 1,
      },
      {
        text: "Министерства юстиции",
        isRight: true,
        id: 2,
      },
      {
        text: "Суда",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 6,
    text: "Что приносит при назначении прокурор:",
    variants: [
      {
        text: "присягу",
        isRight: true,
        id: 0,
      },
      {
        text: "приказ",
        isRight: false,
        id: 1,
      },
      {
        text: "указ",
        isRight: false,
        id: 2,
      },
      {
        text: "клятву",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 7,
    text: "В каком году была создана Прокуратура СССР:",
    variants: [
      {
        text: "1918 год",
        isRight: false,
        id: 0,
      },
      {
        text: "1933 год",
        isRight: true,
        id: 1,
      },
      {
        text: "1941 год",
        isRight: false,
        id: 2,
      },
      {
        text: "1922 года",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 8,
    text: "Первый прокурор Союза ССР:",
    variants: [
      {
        text: "Акулов Иван Алексеевич",
        isRight: true,
        id: 0,
      },
      {
        text: "Вышинский Андрей  Януарьевич",
        isRight: false,
        id: 1,
      },
      {
        text: "Горшенин Константин Петрович ",
        isRight: false,
        id: 2,
      },
      {
        text: "Руденко Роман Андреевич",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 9,
    text: "В каком году появилось наименование «Генеральный прокурор  СССР»:",
    variants: [
      {
        text: "1933 год",
        isRight: false,
        id: 0,
      },
      {
        text: "1943 год",
        isRight: false,
        id: 1,
      },
      {
        text: "1946 год ",
        isRight: true,
        id: 2,
      },
      {
        text: "1954 год",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 10,
    text: "Когда впервые в советский период у прокуроров введена форма с погонами:",
    variants: [
      {
        text: "1933 год",
        isRight: false,
        id: 0,
      },
      {
        text: "1943 год",
        isRight: true,
        id: 1,
      },
      {
        text: "1952 год",
        isRight: false,
        id: 2,
      },
      {
        text: "1954 год",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 11,
    text: "Кто был главным обвинителем от СССР на Нюрнбергском процессе (международный военный трибунал над бывшими руководителями  гитлеровской  Германии):",
    variants: [
      {
        text: "И.В. Сталин",
        isRight: false,
        id: 0,
      },
      {
        text: "Р.А. Буденко",
        isRight: true,
        id: 1,
      },
      {
        text: "Г.К. Жуков",
        isRight: false,
        id: 2,
      },
      {
        text: "К.П. Горшенин",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 12,
    text: "Какого цвета  была форма у советских прокуроров:",
    variants: [
      {
        text: "синего",
        isRight: true,
        id: 0,
      },
      {
        text: "черного",
        isRight: false,
        id: 1,
      },
      {
        text: "темно-серо-зеленого",
        isRight: false,
        id: 2,
      },
      {
        text: "светло-серого",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 13,
    text: "В каком году был принят закон «О прокуратуре Российской Федерации»:",
    variants: [
      {
        text: "1991г.",
        isRight: false,
        id: 0,
      },
      {
        text: "1992г.",
        isRight: true,
        id: 1,
      },
      {
        text: "1993г.",
        isRight: false,
        id: 2,
      },
      {
        text: "1996г.",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 14,
    text: "Единая федеральная система  органов, в задачу которой входит осуществление  от имени Российской Федерации  надзора за  соблюдением Конституции Российской Федерации и исполнением законов, действующих на ее территории:",
    variants: [
      {
        text: "Прокуратура Российской Федерации",
        isRight: true,
        id: 0,
      },
      {
        text: "Верховный Суд Российской Федерации",
        isRight: false,
        id: 1,
      },
      {
        text: "Парламент Российской Федерации",
        isRight: false,
        id: 2,
      },
      {
        text: "Правительство Российской Федерации ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 15,
    text: "К Какой ветви власти относится система органов прокуратуры в России:",
    variants: [
      {
        text: "к судебной",
        isRight: false,
        id: 0,
      },
      {
        text: "ни к одной из трех ветвей власти",
        isRight: true,
        id: 1,
      },
      {
        text: "к законодательной",
        isRight: false,
        id: 2,
      },
      {
        text: "исполнительной",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 16,
    text: "Как осуществляется  прокурорский надзор",
    variants: [
      {
        text: "тайно",
        isRight: false,
        id: 0,
      },
      {
        text: "гласно",
        isRight: true,
        id: 1,
      },
      {
        text: "в зависимости от обстоятельств",
        isRight: false,
        id: 2,
      },
      {
        text: "без разницы ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 17,
    text: "Как называется должностное  лицо, возглавляющее прокуратуру:",
    variants: [
      {
        text: "руководитель",
        isRight: false,
        id: 0,
      },
      {
        text: "начальник",
        isRight: false,
        id: 1,
      },
      {
        text: "прокурор",
        isRight: true,
        id: 2,
      },
      {
        text: "директор",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 18,
    text: "Срок полномочий Генерального Прокурора  Российской Федерации составляет:",
    variants: [
      {
        text: "шесть лет",
        isRight: false,
        id: 0,
      },
      {
        text: "пять лет",
        isRight: true,
        id: 1,
      },
      {
        text: "семь лет",
        isRight: false,
        id: 2,
      },
      {
        text: "четыре года ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 18,
    text: "Срок полномочий Генерального Прокурора  Российской Федерации составляет:",
    variants: [
      {
        text: "шесть лет",
        isRight: false,
        id: 0,
      },
      {
        text: "пять лет",
        isRight: true,
        id: 1,
      },
      {
        text: "семь лет",
        isRight: false,
        id: 2,
      },
      {
        text: "четыре года ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 19,
    text: "Какое из этих утверждений неверно:",
    variants: [
      {
        text: "Прокуратуре запрещено участвовать в правотворческой деятельности",
        isRight: true,
        id: 0,
      },
      {
        text: "Все функции прокуратуры  прописываются в федеральном законодательстве",
        isRight: false,
        id: 1,
      },
      {
        text: "Прокуратура  надзирает за исполнением  законодательства  на территории Российской Федерации",
        isRight: false,
        id: 2,
      },
      {
        text: "Органы прокуратуры не осуществляют предварительное расследование по уголовным делам",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 20,
    text: "Коллегия Генеральной прокуратуры Российской Федерации является:",
    variants: [
      {
        text: "совещательным органом",
        isRight: true,
        id: 0,
      },
      {
        text: "законодательным органом",
        isRight: false,
        id: 1,
      },
      {
        text: "руководящим органом",
        isRight: false,
        id: 2,
      },
      {
        text: "исполнительным органом",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 21,
    text: "К актам прокурорского реагирования относятся:",
    variants: [
      {
        text: "указ",
        isRight: false,
        id: 0,
      },
      {
        text: "приказ",
        isRight: false,
        id: 1,
      },
      {
        text: "распоряжение",
        isRight: false,
        id: 2,
      },
      {
        text: "протест ",
        isRight: true,
        id: 3,
      },
    ],
  },
  {
    id: 22,
    text: "Документ, который подтверждает  личность прокурорского работника, его должность и классный чин:",
    variants: [
      {
        text: "приказ о назначении на должность  ",
        isRight: false,
        id: 0,
      },
      {
        text: "служебное удостоверение",
        isRight: true,
        id: 1,
      },
      {
        text: "Паспорт гражданина Российской Федерации",
        isRight: false,
        id: 2,
      },
      {
        text: "доверенность ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 23,
    text: "Определение соответствия  прокурорского работника  занимаемой должности называется:",
    variants: [
      {
        text: "мерой дисциплинарного воздействия",
        isRight: false,
        id: 0,
      },
      {
        text: "испытательным сроком",
        isRight: false,
        id: 1,
      },
      {
        text: "аттестацией",
        isRight: true,
        id: 2,
      },
      {
        text: "собеседованием",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 24,
    text: "Высшая ведомственная награда в органах прокуратуры:",
    variants: [
      {
        text: "нагрудный знак  «Почетный работник  прокуратуры Российской Федерации»",
        isRight: true,
        id: 0,
      },
      {
        text: "нагрудный знак «За безупречную  службу в прокуратуре Российской Федерации»",
        isRight: false,
        id: 1,
      },
      {
        text: "награждение именным оружием",
        isRight: false,
        id: 2,
      },
      {
        text: "зачисление в штат органов прокуратуры навечно",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 25,
    text: "Генеральный прокурор Российской Федерации  назначается на должность и освобождается от должности:",
    variants: [
      {
        text: "Советом Федерации Федерального Собрания Российской Федерации  по представления Президента Российской Федерации ",
        isRight: true,
        id: 0,
      },
      {
        text: "Государственной Думой Российской Федерации по представлению Президента Российской Федерации ",
        isRight: false,
        id: 1,
      },
      {
        text: "Президентом Российской Федерации ",
        isRight: false,
        id: 2,
      },
      {
        text: "Выбирается на коллегии Генеральной Прокуратуры Российской Федерации ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 26,
    text: "Могут ли прокуроры органов прокуратуры быть членами выборных  и иных органов, образуемых органами  государственной власти  и органами местного самоуправления?",
    variants: [
      {
        text: "Да",
        isRight: false,
        id: 0,
      },
      {
        text: "Нет",
        isRight: true,
        id: 1,
      },
      {
        text: "Да, но только в общественных организациях ",
        isRight: false,
        id: 2,
      },
      {
        text: "Да, но только в политических партиях ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 27,
    text: "Образование, реорганизация  и ликвидация  органов и учреждений  прокуратуры, определение их статуса и компетенции осуществляются…",
    variants: [
      {
        text: "Председателем Правительства РФ ",
        isRight: false,
        id: 0,
      },
      {
        text: "Министром юстиции РФ",
        isRight: false,
        id: 1,
      },
      {
        text: "Генеральным прокурором РФ ",
        isRight: true,
        id: 2,
      },
      {
        text: "Председателем Правительства РФ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 28,
    text: "Создание  и деятельность на территории Российской Федерации  органов прокуратуры, не входящих в единую систему прокуратуры РФ:",
    variants: [
      {
        text: "не допускается",
        isRight: true,
        id: 0,
      },
      {
        text: "допускается, но только с разрешения  Генерального прокурора РФ",
        isRight: false,
        id: 1,
      },
      {
        text: "допускается,  но только  в случае введения чрезвычайного положения ",
        isRight: false,
        id: 2,
      },
      {
        text: "допускается, н о только с согласия Президента  Рф",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 29,
    text: "В течение, какого срока со дня представления об устранении нарушений закона должностному лицу, должны быть приняты конкретные меры по их устранению?",
    variants: [
      {
        text: "в течение трех дней",
        isRight: false,
        id: 0,
      },
      {
        text: "в течение недели",
        isRight: false,
        id: 1,
      },
      {
        text: "в течение месяца",
        isRight: true,
        id: 2,
      },
      {
        text: "в течение четырнадцати дней",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 30,
    text: "В целях предупреждения правонарушений и при наличии сведений о готовящихся противоправных деяниях прокурор или его заместитель направляет в письменной форме должностным лицам…",
    variants: [
      {
        text: "протест о недопустимости нарушения закона",
        isRight: false,
        id: 0,
      },
      {
        text: "предостережение о недопустимости нарушения закона",
        isRight: true,
        id: 1,
      },
      {
        text: "постановление о наблюдении в целях предупреждения правонарушений",
        isRight: false,
        id: 2,
      },
      {
        text: "требование об устранении нарушения закона",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 31,
    text: "Предельный возраст  пребывания на службе  Генерального Прокурора  Российской Федерации…",
    variants: [
      {
        text: "70 лет",
        isRight: false,
        id: 0,
      },
      {
        text: "65 лет",
        isRight: false,
        id: 1,
      },
      {
        text: "законом не определен",
        isRight: true,
        id: 2,
      },
      {
        text: "75 лет",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 32,
    text: "Кто назначает заместителя  Генерального прокурора Российской Федерации:",
    variants: [
      {
        text: "Совет Федерации  Федерального Собрания Российской Федерации ",
        isRight: true,
        id: 0,
      },
      {
        text: "Президент Российской Федерации",
        isRight: false,
        id: 1,
      },
      {
        text: "Государственная Дума Российской Федерации ",
        isRight: false,
        id: 2,
      },
      {
        text: "Генеральный прокурор Российской Федерации ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 33,
    text: "При обращении прокурора в суд в порядке гражданского судопроизводства:",
    variants: [
      {
        text: "иск освобождается от государственной пошлины ",
        isRight: true,
        id: 0,
      },
      {
        text: "судебные издержки относятся на счет федерального казначейства",
        isRight: false,
        id: 1,
      },
      {
        text: "суд обязан рассрочить уплату им государственной пошлины",
        isRight: false,
        id: 2,
      },
      {
        text: "лицо, в чьих интересах  обращается прокурор в суд, уплачивает  государственную пошлину органам прокуратуры ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 34,
    text: "Если установлено, что работник прокуратуры осуществляет предпринимательскую деятельность, то он:",
    variants: [
      {
        text: "лишается ежемесячной премии",
        isRight: false,
        id: 0,
      },
      {
        text: "подлежит наложению строгого выговора",
        isRight: false,
        id: 1,
      },
      {
        text: "подлежит увольнению из органов прокуратура в связи с утратой доверия",
        isRight: true,
        id: 2,
      },
      {
        text: "подлечит привлечению к административной ответственности",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 35,
    text: "Имеет ли право бывший сотрудник прокуратуры, уволенный по отрицательным мотивам, носить форменную одежду после увольнения:",
    variants: [
      {
        text: "да, если выслуга составляет более 20 лет",
        isRight: false,
        id: 0,
      },
      {
        text: "да, вне зависимости от стажа работы",
        isRight: false,
        id: 1,
      },
      {
        text: "нет, ни при каких обстоятельствах ",
        isRight: true,
        id: 2,
      },
      {
        text: "да, если выслуга составляет более 25 лет",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 36,
    text: "Правотворческая деятельность органов и должностных лиц прокуратуры выражается в следующем:",
    variants: [
      {
        text: "присутствие на заседаниях палат Федерального Собрания РФ, их комитетов и комиссий, Правительства РФ, представительных (законодательных) и исполнительных органов субъектов РФ и органов местного самоуправления",
        isRight: false,
        id: 0,
      },
      {
        text: "требовать точного и единообразного исполнения действующего законодательства",
        isRight: false,
        id: 1,
      },
      {
        text: "внесение в законодательные органы и органы, обладающие правом законодательной инициативы, соответствующего и нижестоящего уровней предложения об изменении, о дополнении, об отмене или о принятии законов и иных нормативных правовых актов",
        isRight: false,
        id: 2,
      },
      {
        text: "во всех вышеперечисленных функциях",
        isRight: true,
        id: 3,
      },
    ],
  },
  {
    id: 37,
    text: "Какое из этих утверждений верно?",
    variants: [
      {
        text: "Сотрудником прокуратуры не может быть лицо с иностранным гражданством",
        isRight: true,
        id: 0,
      },
      {
        text: "Образование сотрудника прокуратуры не обязательно должно быть им получено по государственно аккредитованной программе, главное – юридическая направленность",
        isRight: false,
        id: 1,
      },
      {
        text: "По общему правилу срок испытания при приеме на работу в органы прокуратуры не превышает 12 месяцев",
        isRight: false,
        id: 2,
      },
      {
        text: "соответствие сотрудника прокуратуры занимаемой должности устанавливается  путем собеседования ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 38,
    text: "Максимальный срок  прокурорской проверки в ходе осуществления надзора за исполнением законов не должен превышать:",
    variants: [
      {
        text: "30 календарных дней",
        isRight: true,
        id: 0,
      },
      {
        text: "45 календарных дней",
        isRight: false,
        id: 1,
      },
      {
        text: "10 рабочих дней",
        isRight: false,
        id: 2,
      },
      {
        text: "60 календарных дней",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 39,
    text: "Прокурором Кировской области в настоящее время  является…",
    variants: [
      {
        text: "Бережицкий Сергей Петрович",
        isRight: false,
        id: 0,
      },
      {
        text: "Оборок Андрей Николаевич",
        isRight: true,
        id: 1,
      },
      {
        text: "Журков Николай Васильевич",
        isRight: false,
        id: 2,
      },
      {
        text: "Ефремов Николай Александрович ",
        isRight: false,
        id: 3,
      },
    ],
  },
  {
    id: 40,
    text: "Прокурором г.Кирова в настоящее время является…",
    variants: [
      {
        text: "Шиляев Евгений Алексеевич",
        isRight: true,
        id: 0,
      },
      {
        text: "Смоленцев Дмитрий Владимирович",
        isRight: false,
        id: 1,
      },
      {
        text: "Саркитов Руслан Сапаралиевич",
        isRight: false,
        id: 2,
      },
      {
        text: "Москаль Владимир Иванович",
        isRight: false,
        id: 3,
      },
    ],
  },
];
